app/views/estimates/_form.html.haml

SELECT "clients"."id", "clients"."first_name", "clients"."last_name", "clients"."middle_name" FROM "clients" WHERE "clients"."deleted_at" IS NULL
---
          .col-sm-6
            = f.input :client_id, label: false, as: :select, collection: Client.select(:id, :first_name, :last_name, :middle_name).collect {|c| [ c.full_name, c.id ] }, class: 'form-control'
          .col-sm-3