app/views/estimates/export_pdf.html.haml

SELECT "stages".* FROM "stages" WHERE "stages"."estimate_id" = $1  [["estimate_id", 9]]
---

    - @estimate[:stages].each do |stage|