app/views/composites/_composition_fields.html.haml

    %td.unit-name
      = f.object.children.present? ? f.object.children.unit.name : ''
---
SELECT  "units".* FROM "units" WHERE "units"."deleted_at" IS NULL AND "units"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]