app/views/budgets/_stages.html.haml

SELECT "units".* FROM "units" WHERE "units"."deleted_at" IS NULL AND "units"."id" = 1
---
                        %input.form-control.template-quantity{ placeholder: "Введите количество", type: 'number', ng: { model: 'template.quantity', change: 'ctrl.updateTemplateValue(template)' } }
                      %td {{ template.value.unit }}
        .modal-footer