app/views/clients/_listing.html.haml

SELECT "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."client_id" IN (1, 2, 3)
---
%tr{ class: client.archived ? 'archived-client' : nil }
  %td.cursor-pointer{ ng: { click: "ctrl.openEstimates(#{client.id})" } }= client.full_name

SELECT COUNT(*) FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."client_id" = $1  [["client_id", 1]]
---
    %a{href: "https://artkarkas.megaplan.ru/crm/#{client.crm}/card/", target: 'blank', rel: 'no-follow'}= client.crm
  %td.cursor-pointer{ ng: { click: "ctrl.openEstimates(#{client.id})" } }= client.estimates.count