app/views/clients/index.html.haml

SELECT "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."client_id" IN (1, 2, 3)
---
            %tr{ ng: { repeat: 'client in owned_users track by $index' } }
              %td.cursor-pointer{ ng: { click: "ctrl.openEstimates(client.id)" } } {{ client.full_name }}