app/views/audits/index.html.haml

          %option{ value: '' } Пользователь
          - User.all.each do |user|
---
SELECT "users".* FROM "users"