app/controllers/audits_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if search? || date_filter?
      @audits = Audit.includes(:user, :auditable)