app/controllers/audits_controller.rb

  def index
    @audits = Audit.all

    if search? || date_filter?
      if params[:search]['user_id'].present?
        user = User.find(params[:search]['user_id'])
---
SELECT "audits".* FROM "audits"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]