app/controllers/clients_controller.rb

SELECT "user_clients".* FROM "user_clients" INNER JOIN "clients" ON "clients"."id" = "user_clients"."client_id" AND "clients"."deleted_at" IS NULL WHERE (user_id = 1 and owner = false)
SELECT "user_clients".* FROM "user_clients" INNER JOIN "clients" ON "clients"."id" = "user_clients"."client_id" AND "clients"."deleted_at" IS NULL WHERE "clients"."archived" = $1 AND (user_id = 1 and owner = false)  [["archived", false]]
SELECT "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."client_id" IN (1, 2, 3)
SELECT "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL AND "clients"."id" IN (1, 2, 3)
---
  def index
    @user_clients = UserClient.joins(:client)

    unless params[:archived].present?
      @user_clients = @user_clients.where(clients: {archived: false})
    end

    @owned     = @user_clients.owner(current_user).includes(client: [:estimates])
    @delegated = @user_clients.delegated(current_user).includes(client: [:estimates])

    if params[:name].present?
      @owned = @owned.select { |m| m.client.full_name.downcase.include? params[:name].downcase }

SELECT  "user_clients".* FROM "user_clients" WHERE "user_clients"."user_id" = 1 AND "user_clients"."client_id" = 1 LIMIT $1  [["LIMIT", 1]]
---
  def edit
    authorize! :view, @client
    @shared_users = UserClient.where(client: @client).where.not(user: current_user).map(&:user)

UPDATE "clients" SET "archived" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["archived", true], ["updated_at", 2017-04-27 20:14:49 UTC], ["id", 3]]
SELECT  "user_clients".* FROM "user_clients" WHERE "user_clients"."user_id" = 1 AND "user_clients"."client_id" = 3 LIMIT $1  [["LIMIT", 1]]
---
  def update
    authorize! :edit, @client
    if @client.update(client_params)
      @client.share(JSON.parse(params[:client_users]) << current_user.id)
      redirect_to clients_path
    else
      @shared_users = UserClient.where(client: @client).where.not(user: current_user).map(&:user)

SELECT  "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL AND "clients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_client
    @client = Client.find(params[:id])