app/controllers/composites_controller.rb

  def index
    @composites = Composite.includes(:category, :unit).all
    @composites = @composites.where("lower(name) like ?", "%#{params[:name].downcase}%") if params[:name].present?
    @composites = @composites.where(category_id: params[:category])                      if params[:category].present?
---
SELECT "categories".* FROM "categories" WHERE "categories"."deleted_at" IS NULL AND "categories"."id" IN (1, 2)
SELECT "units".* FROM "units" WHERE "units"."deleted_at" IS NULL AND "units"."id" IN (1, 3)

  def update
    if at_least_one_composition? && @composite.update(composite_params)
---
UPDATE "compositions" SET "deleted_at" = '2017-04-27 00:31:38.150639' WHERE "compositions"."id" = $1  [["id", 4]]