app/controllers/constructor_objects_controller.rb

SELECT  "constructor_objects".* FROM "constructor_objects" WHERE "constructor_objects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def info
    constructor_object = ConstructorObject.find(params[:id])