app/controllers/estimates_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL AND "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def copy
    estimate = Estimate.includes(:stages, :client_files, :technical_files).find(params[:estimate_id])
    client   = Client.find(params[:client_id])