app/controllers/estimates_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL AND "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."client_id" = $1 AND (lower(name) like '%тест%')  [["client_id", 1]]
---
  def index
    return redirect_to clients_path unless params[:client_id].present?

    @client    = Client.includes(:estimates).find(params[:client_id])

SELECT  "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL AND "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def new
    @estimate  = params[:client_id].present? ? Client.find(params[:client_id]).estimates.build : Estimate.new

INSERT INTO "estimates" ("name", "client_id", "first_floor_height", "price", "area", "discount_title", "discount_by_stages", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "stages" ("estimate_id", "number", "price", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @estimate = Estimate.new(estimate_params.merge(user_id: current_user.id))
    params[:estimate][:discount_by_stages].each do |key, value|
      @estimate.discount_by_stages[key.to_i] = value.blank? ? 0 : value
    end
    if @estimate.save

UPDATE "estimates" SET "discount_by_stages" = $1, "price" = $2, "updated_at" = $3 WHERE "estimates"."id" = $4  [["discount_by_stages", #<BigDecimal:7fae40019c08,'0.0',9(9)>], ["price", #<BigDecimal:563f1ed69f30,'0.4179349999 9999995E3',27(27)>], ["updated_at", 2017-04-27 20:04:06 UTC], ["id", 6]]
UPDATE "stages" SET "price" = $1, "total_price" = $2, "updated_at" = $3 WHERE "stages"."id" = $4  [["price", #<BigDecimal:7fe5f8647720,'0.1435E3',18(36)>], ["total_price", #<BigDecimal:7fe5f86473d8,'0.1435E3',18(36)>], ["updated_at", 2017-04-27 02:18:18 UTC], ["id", 14]]
---
  def update
    params[:estimate][:discount_by_stages].each do |key, value|
      @estimate.discount_by_stages[key.to_i] = value.blank? ? 0 : value
    end
    if @estimate.update(estimate_params)

SELECT  "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "stages".* FROM "stages" WHERE "stages"."estimate_id" = 6
SELECT  "budgets".* FROM "budgets" WHERE "budgets"."type" IN ('Estimate') AND "budgets"."deleted_at" IS NULL AND "budgets"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def copy
    estimate     = Estimate.includes(:stages, :client_files, :technical_files).find(params[:estimate_id])
    new_estimate = Services::Budget::Copy.new(
      budget:    estimate,
      type:      :estimate,
      name:      params[:name],
      client_id: params[:client_id]
    ).call

    alert = new_estimate.errors.first[1] unless new_estimate.valid?

INSERT INTO "asset_files" ("data_file_name", "data_content_type", "data_file_size", "data_updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["data_file_name", "Lakeside_SunRise_1920x1080.jpg"], ["data_content_type", "image/jpeg"], ["data_file_size", 926548], ["data_updated_at", 2017-04-29 00:51:11 UTC]]
---
  def files
    f = AssetFile.create(data: params[:file])

SELECT  "budgets".* FROM "budgets" WHERE "budgets"."type" IN ('Estimate') AND "budgets"."deleted_at" IS NULL AND "budgets"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT  "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def export_pdf
    @estimate = Estimate.find(params[:estimate_id]).for_export_budget

SELECT  "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def export_doc
    estimate = Estimate.find(params[:estimate_id])

SELECT  "estimates".* FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_estimate
    @estimate = Estimate.find(params[:id])