app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.order(:id).all
---
SELECT "expenses".* FROM "expenses" ORDER BY "expenses"."id" ASC

  def update
    Expense.update_values(params[:values])
---
UPDATE "expenses" SET "percent" = $1, "updated_at" = $2 WHERE "expenses"."id" = $3  [["percent", #<BigDecimal:561d14a9c338,'0.5E1',9(18)>], ["updated_at", 2017-04-26 20:29:02 UTC], ["id", 1]]