app/controllers/home_controller.rb

  def index
    @clients   = current_user.clients.order(updated_at: :desc).limit(5)
---
SELECT  "clients".* FROM "clients" INNER JOIN "user_clients" ON "clients"."id" = "user_clients"."client_id" WHERE "clients"."deleted_at" IS NULL AND "user_clients"."user_id" = $1 ORDER BY "clients"."updated_at" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 5]]