app/controllers/primitives_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."deleted_at" IS NULL
SELECT "categories".* FROM "categories" WHERE "categories"."deleted_at" IS NULL AND "categories"."id" = 1
SELECT "units".* FROM "units" WHERE "units"."deleted_at" IS NULL AND "units"."id" IN (6, 5)
---
  def index
    @primitives = Primitive.includes(:category, :unit).all
    @primitives = @primitives.where("lower(name) like ?", "%#{params[:name].downcase}%") if params[:name].present?
    @primitives = @primitives.where(category_id: params[:category])                      if params[:category].present?