app/controllers/products_controller.rb

  def index
    @products = Product.includes(:category, :unit).all
    @products = @products.where("lower(name) like ?", "%#{params[:name].downcase}%") if params[:name].present?
    @products = @products.where(category_id: params[:category])                      if params[:category].present?
---
SELECT "categories".* FROM "categories" WHERE "categories"."deleted_at" IS NULL AND "categories"."product" = $1  [["product", true]]
SELECT "products".* FROM "products" WHERE "products"."deleted_at" IS NULL AND "products"."category_id" = 9
SELECT "categories".* FROM "categories" WHERE "categories"."deleted_at" IS NULL AND "categories"."id" IN (9, 12, 10)
SELECT "units".* FROM "units" WHERE "units"."deleted_at" IS NULL AND "units"."id" IN (1, 3, 5)

  def update
    if @product.update(product_params)
      if @product.custom
        @product.save_sets(JSON.parse(params[:product_sets]))
      else
        @product.save_compositions(JSON.parse(params[:product_compositions]))
      end

      redirect_to products_path
    else
      flash.now[:alert] = @product.errors.messages[:base].first if @product.errors.messages[:base].present?
---
INSERT INTO "product_compositions" ("product_id", "constructor_object_id", "value") VALUES ($1, $2, $3) RETURNING "id"  [["product_id", 1], ["constructor_object_id", 6], ["value", 5]]
UPDATE "product_compositions" SET "deleted_at" = '2017-04-27 00:55:18.459515' WHERE "product_compositions"."id" = $1  [["id", 4]]
SELECT "product_compositions".* FROM "product_compositions" WHERE "product_compositions"."deleted_at" IS NULL AND "product_compositions"."product_id" = $1 AND ("product_compositions"."id" NOT IN (1, 6))  [["product_id", 1]]

  def find_product
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."deleted_at" IS NULL AND "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]