app/controllers/reports_controller.rb

  def floor_popularity
    @report = {}
    filter_estimates = Estimate.only_signed.date_start(params[:date_start]).date_end(params[:date_end])
    all = filter_estimates.count
---
SELECT COUNT(*) FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND (signed) AND (signing_date >= '2017-04-11') AND (signing_date <= '2017-04-29') AND (floors = '1')

  def area_popularity
    @report = {}
    filter_estimates = Estimate.only_signed.date_start(params[:date_start]).date_end(params[:date_end])
    all = filter_estimates.count
---
SELECT COUNT(*) FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND (signed) AND (area >= 10) AND (area < 30)

  def estimate_conversion
    @report = []
    User.all.each do |user|
      date_start = params[:date_start].present? ? Time.new(params[:date_start]) : user.created_at
      date_end = params[:date_end].present? ? Time.new(params[:date_end]) : Time.now
      interval = ((date_end - date_start) / (3600 * 24 * 30)).to_i + 1
      estimates = user.estimates.date_start(date_start).date_end(date_end)
      all = estimates.count
      signed = estimates.only_signed.count
      @report << {
        user_name: user.full_name,
        estimates_all: estimates.count,
        estimates_signed: estimates.only_signed.count,
        conversion: signed.zero? ? 0 : all / signed,
        profit: user.estimates.only_signed.sum(:price).to_i,
        profit_month: interval.zero? ? 0 : (user.estimates.only_signed.sum(:price) / interval).to_i
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."user_id" = $1 AND (signing_date >= '2017-04-24 22:08:59.489259') AND (signing_date <= '2017-04-29 20:18:32.028537') AND (signed)  [["user_id", 1]]
SELECT SUM("estimates"."price") FROM "estimates" WHERE "estimates"."deleted_at" IS NULL AND "estimates"."user_id" = $1 AND (signed)  [["user_id", 1]]

  def product_popularity
    @stage_products = StageProduct.estimate_signed
    @stage_products = @stage_products.where('budgets.signing_date > ?', params[:date_start]) if params[:date_start].present?
---
SELECT "products".* FROM "products" WHERE "products"."deleted_at" IS NULL AND (name ILIKE '%Кон%')