app/controllers/solutions_controller.rb

INSERT INTO "stages" ("budget_id", "number", "price", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @solution = Solution.new(solution_params)
    params[:solution][:discount_by_stages].each do |key, value|
      @solution.discount_by_stages[key.to_i] = value
    end

    if @solution.save

SELECT  "budgets".* FROM "budgets" WHERE "budgets"."type" IN ('Solution') AND "budgets"."deleted_at" IS NULL AND "budgets"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def copy
    solution = Solution.includes(:stages, :client_files, :technical_files).find(params[:solution_id])
    new_estimate = Services::Budget::Copy.new(
      budget:    solution,
      type:      :estimate,
      name:      params[:name],
      client_id: params[:client_id]
    ).call

    alert = new_estimate.errors.first[1] unless new_estimate.valid?