app/controllers/solutions_controller.rb

  def copy
    solution = Solution.includes(:stages, :client_files, :technical_files).find(params[:solution_id])
    client   = Client.find(params[:client_id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."deleted_at" IS NULL AND "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]