app/views/products/index.html.haml

    .col-sm-3
      = select_tag 'category', options_for_select(Category.where(product: true).collect{|x| [x.name, x.id]}), include_blank: 'Категория', class: 'form-control'
---
SELECT "categories".* FROM "categories" WHERE "categories"."deleted_at" IS NULL AND "categories"."product" = $1  [["product", true]]