app/views/solutions/index.html.haml

SELECT "clients".* FROM "clients" INNER JOIN "user_clients" ON "clients"."id" = "user_clients"."client_id" WHERE "clients"."deleted_at" IS NULL AND "user_clients"."user_id" = $1  [["user_id", 1]]
---
                .form-group
                  %label.col-sm-3.control-label Клиент
                  .col-sm-9= select_tag :client_id, options_for_select(current_user.clients.active.all.map{ |u| [u.full_name, u.id] }), class: 'form-control'
            .modal-footer