app/views/reports/material_consumption.html.haml

  .form-horizontal.row
    = form_tag reports_material_consumption_path, :method => 'get' do
      .col-sm-2= text_field_tag :name, params[:name], class: 'form-control', placeholder: 'Наименование'
      .col-sm-2= select_tag 'category', options_for_select(Category.where(product: false).collect{|x| [x.name, x.id]}, selected: params[:category]), include_blank: 'Категория', class: 'form-control'
      .col-sm-1
---
SELECT "categories".* FROM "categories" WHERE "categories"."deleted_at" IS NULL AND "categories"."product" = $1  [["product", false]]

            %td= primitive.unit.name
            %td= ReportPrimitive.by_constructor_object(primitive.id).date_start(params[:date_start]).date_end(params[:date_end]).sum(:amount) / @month
---
SELECT "constructor_objects".* FROM "constructor_objects" WHERE "constructor_objects"."type" IN ('Primitive') AND "constructor_objects"."deleted_at" IS NULL
SELECT SUM("report_primitives"."amount") FROM "report_primitives" WHERE (constructor_object_id = 2)