app/views/reports/product_popularity.html.haml

      .col-sm-2
        = select_tag 'category', options_for_select(Category.where(product: false).collect{|x| [x.name, x.id]}, selected: params[:category]), include_blank: 'Категория', class: 'form-control'
      .col-sm-1
---
SELECT "categories".* FROM "categories" WHERE "categories"."deleted_at" IS NULL AND "categories"."product" = $1  [["product", false]]

            %td
              = (@stage_products.by_product(product.id).count * 100 / @stage_products.count).to_s + "%" unless @stage_products.empty?
---
SELECT "products".* FROM "products" WHERE "products"."deleted_at" IS NULL AND (name ILIKE '%Кон%')